Revit 2026 API

# View3DGetRenderingSettings Method

---

Returns the current rendering settings for this 3d view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RenderingSettings GetRenderingSettings()
```
```vb
Public Function GetRenderingSettings As RenderingSettings
```
```cpp
public:
RenderingSettings^ GetRenderingSettings()
```
```fsharp
member GetRenderingSettings : unit -> RenderingSettings
```

#### Return Value

RenderingSettings The returned object represents the current rendering settings. If you change the returned object, you need to call SetRenderingSettings to apply the new settings back to Revit.

#### Reference

View3D Class

Autodesk.Revit.DB Namespace